app/controllers/alarms_controller.rb

  def index
    @alarms = current_user.alarms.all
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."user_id" = $1  [["user_id", 7]]

  def new
    @alarms = current_user.alarms.all
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."user_id" = $1  [["user_id", 7]]

  def create

    @alarm = current_user.alarms.new(post_params)
    @alarm.save
---
INSERT INTO "alarms" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 13 Feb 2014 14:31:55 UTC +00:00], ["title", "sdasd"], ["updated_at", Thu, 13 Feb 2014 14:31:55 UTC +00:00], ["user_id", 7]]

  def edit
        @alarms = current_user.alarms.all

      @alarm = Alarm.find(params[:id])
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."user_id" = $1  [["user_id", 7]]
SELECT "alarms".* FROM "alarms" WHERE "alarms"."id" = $1 LIMIT 1  [["id", "30"]]

  def update
    @alarm = Alarm.find(params[:id])
    if @alarm.update_attributes(params[:alarm])
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."id" = $1 LIMIT 1  [["id", "30"]]
UPDATE "alarms" SET "hour_time" = $1, "minute_time" = $2, "reminder_time" = $3, "updated_at" = $4 WHERE "alarms"."id" = 30  [["hour_time", "05"], ["minute_time", "01"], ["reminder_time", "01"], ["updated_at", Thu, 13 Feb 2014 15:51:22 UTC +00:00]]

  def destroy
    @post = Alarm.find(params[:id])
    @post.destroy
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."id" = $1 LIMIT 1  [["id", "25"]]
DELETE FROM "alarms" WHERE "alarms"."id" = $1  [["id", 25]]

  def show
    @alarm = Alarm.find(params[:id])
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."id" = $1 LIMIT 1  [["id", "myAlarms"]]