app/controllers/welcome_controller.rb

  def index
    @alarms = current_user.alarms.all
---
SELECT "alarms".* FROM "alarms" WHERE "alarms"."user_id" = $1  [["user_id", 7]]